---
kind: enumMember
id: F:Autodesk.Revit.DB.ScheduleFieldType.MaterialQuantity
enum: Autodesk.Revit.DB.ScheduleFieldType
source: html/9888db7d-00d0-4fd7-a1a9-cdd1fb5fce16.htm
---
# Autodesk.Revit.DB.ScheduleFieldType.MaterialQuantity

In a material takeoff, a value representing how a particular material
 is used within a scheduled element. The parameter ID can be
 MATERIAL_AREA, MATERIAL_VOLUME, or MATERIAL_ASPAINT.